app/controllers/test_results_controller.rb

  def create
    @test_result = TestResult.new
    @test_result.answer_ids = (params[:answers] || {}).collect { |k, v| v }
---
SELECT "answers".* FROM "answers" WHERE ("answers".question_id IN (1,2,3,4,5,6,7,8,9,10))

  def load_questions
    @questions = Question.all(:include => :answers)
---
SELECT "answers".id FROM "answers" INNER JOIN "answers_test_results" ON "answers".id = "answers_test_results".answer_id WHERE ("answers_test_results".test_result_id = NULL )
SELECT * FROM "questions"